app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      if Artist.find_by(id: params[:artist_id])
        @songs = Artist.find(params[:artist_id]).songs
      else
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
---
  def show
    if params[:artist_id]
      if Song.find_by(id: params[:id])
        @song = Song.find_by(id: params[:id])
      else
<<<<<<< HEAD
        flash[:alert] = "Song not found"
=======
        flash[:alert] = ""
>>>>>>> 2ed8cafbaaf08cf4ccda6fabab5491ebca81718a
        redirect_to artist_songs_path(Artist.find_by(id: params[:artist_id]))